In [1]:
import pandas as pd
import datetime

In [2]:
df = pd.read_csv('manipulando_datas.csv', sep=';')

In [3]:
df.head()

,Data,Hora,Precipitacao,TempMaxima,TempMinima,Insolacao,Evaporacao Piche,Temp Comp Media,Umidade Relativa Media,Velocidade do Vento Media
0,01/01/1990,1200,0.2,29.8,23.5,9.2,1.7,27.08,75.25,1.500000
1,02/01/1990,1200,0.0,29.8,23.8,6.0,3.0,26.20,86.50,1.200000
2,03/01/1990,1200,1.0,30.0,23.8,2.1,2.0,26.30,85.00,0.533333
3,04/01/1990,1200,0.0,26.6,24.0,0.0,2.0,25.24,89.75,0.000000
4,05/01/1990,0,NaN,29.6,NaN,7.5,1.0,25.88,83.75,1.400000

In [4]:
df.drop(['Hora','Precipitacao','TempMaxima','TempMinima','Insolacao','Evaporacao Piche','Temp Comp Media','Umidade Relativa Media','Velocidade do Vento Media'], axis=1, inplace=True)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
Data    5 non-null object
dtypes: object(1)
memory usage: 120.0+ bytes

### Método 1 - Transformando no formato datetime e separando dia, mês e ano

In [6]:
#Criando um novo campo DATA1 como datetime 
df['DATA1'] = pd.to_datetime(df['Data'], format = '%d/%m/%Y')
df['DATA1']

0   1990-01-01
1   1990-01-02
2   1990-01-03
3   1990-01-04
4   1990-01-05
Name: DATA1, dtype: datetime64[ns]

In [7]:
#Criando as colunas
df['DIA1'] = df['DATA1'].dt.day
df['MES1'] = df['DATA1'].dt.month
df['ANO1'] = df['DATA1'].dt.year

In [8]:
df.head()

         Data      DATA1  DIA1  MES1  ANO1
0  01/01/1990 1990-01-01     1     1  1990
1  02/01/1990 1990-01-02     2     1  1990
2  03/01/1990 1990-01-03     3     1  1990
3  04/01/1990 1990-01-04     4     1  1990
4  05/01/1990 1990-01-05     5     1  1990

### Método 2 - Separando dia, mês e ano como strings

In [9]:
data = df['Data']

In [10]:
# Ano
ano = [a.split('/')[2] for a in data]

#Mês
mes = [a.split('/')[1] for a in data]

#dia
dia = [a.split('/')[0] for a in data]

In [11]:
#Criando colunas
df['DIA2'] = dia
df['MES2'] = mes 
df['ANO2'] = ano

In [12]:
df.head()

         Data      DATA1  DIA1  MES1  ANO1 DIA2 MES2  ANO2
0  01/01/1990 1990-01-01     1     1  1990   01   01  1990
1  02/01/1990 1990-01-02     2     1  1990   02   01  1990
2  03/01/1990 1990-01-03     3     1  1990   03   01  1990
3  04/01/1990 1990-01-04     4     1  1990   04   01  1990
4  05/01/1990 1990-01-05     5     1  1990   05   01  1990

### Criando uma coluna NEWDATE no formato datetime a partir dos campos dia, mês e ano como strings

In [13]:
#Convertendo as strings em int64
df[['ANO2', 'MES2', 'DIA2']] = df[['ANO2', 'MES2', 'DIA2']].astype('int64')

In [14]:
#Convertendo para o formato datetime
df['NEWDATE']=df[['ANO2', 'MES2', 'DIA2']].apply(lambda row: datetime.datetime(year=row['ANO2'],month=row['MES2'], day=row['DIA2']), axis=1)

In [15]:
df.head()

         Data      DATA1  DIA1  MES1  ANO1  DIA2  MES2  ANO2    NEWDATE
0  01/01/1990 1990-01-01     1     1  1990     1     1  1990 1990-01-01
1  02/01/1990 1990-01-02     2     1  1990     2     1  1990 1990-01-02
2  03/01/1990 1990-01-03     3     1  1990     3     1  1990 1990-01-03
3  04/01/1990 1990-01-04     4     1  1990     4     1  1990 1990-01-04
4  05/01/1990 1990-01-05     5     1  1990     5     1  1990 1990-01-05